# WaveNumWaveSets Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Wave..::..WaveNumWaveSets Property
Wave Class See Also
---
The property labeled "Number" from the "Wave" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string WaveNumWaveSets { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WaveNumWaveSets As String
	Get
```

Visual C++
---
```text
public:
static property String^ WaveNumWaveSets {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyInteger" within the range of "1, 50".
# See Also
Wave Class
Autodesk.Revit.DB.Visual Namespace